includes_app/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?, ?)  [["id", 4], ["id", 3], ["id", 1], ["id", 2]]
---
  def index
    # @posts = Post.all
    @posts = Post.includes(:user)